# -*- coding: utf-8 -*-
import pandas as pd
import numpy as np
'''
数据的累计统计分析
============================================================================
适用于Series和DataFrame类型，累计计算
  方法                            说明
.cumsum()               依次给出前1、2、…、n个数的和
.cumprod()              依次给出前1、2、…、n个数的积
.cummax()               依次给出前1、2、…、n个数的最大值
.cummin()               依次给出前1、2、…、n个数的最小值
============================================================================
'''
b=pd.DataFrame(np.arange(20).reshape(4,5),index=['c','a','d','b'])
print(b,'\n')
print(b.cumsum(),'\n')
print(b.cumprod(),'\n')
print(b.cummin(),'\n')
print(b.cummax(),'\n')



'''
============================================================================
适用于Series和DataFrame类型，滚动计算（窗口计算）
      方法                             说明
.rolling(w).sum()             依次计算相邻w个元素的和
.rolling(w).mean()            依次计算相邻w个元素的算术平均值
.rolling(w).var()             依次计算相邻w个元素的方差
.rolling(w).std()             依次计算相邻w个元素的标准差
.rolling(w).min() .max()      依次计算相邻w个元素的最小值和最大值
============================================================================
'''
print('=========================================================')
print(b,'\n')
print(b.rolling(2).sum(),'\n')
print(b.rolling(3).sum(),'\n')








